app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def upvote
     @band = Band.find(params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
   def downvote
     @band = Band.find(params[:id])

INSERT INTO "bands" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "cheese nuggets"], ["description", "sound disgusting right about meow"], ["created_at", "2018-03-28 16:55:31.935511"], ["updated_at", "2018-03-28 16:55:31.935511"]]
---
  def create
    @band = Band.new(band_params)

    respond_to do |format|
      if @band.save

UPDATE "bands" SET "description" = ?, "updated_at" = ? WHERE "bands"."id" = ?  [["description", "Look at this photograph!"], ["updated_at", "2018-03-28 19:57:01.560617"], ["id", 16]]
---
  def update
    respond_to do |format|
      if @band.update(band_params)

DELETE FROM "bands" WHERE "bands"."id" = ?  [["id", 1]]
---
  def destroy
    @band.destroy

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_band
      @band = Band.find(params[:id])