app/controllers/sessions_controller.rb

INSERT INTO "users" ("provider", "uid", "name", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? LIMIT ?  [["provider", "instagram"], ["uid", "1625379866"], ["LIMIT", 1]]
---
  def create
    auth = request.env["omniauth.auth"]
    user = User.find_by_provider_and_uid(auth["provider"], auth["uid"])  || User.create_with_omniauth(auth)